project/report/20180726/055825_bw-exp/cache/2.900000.txt

['<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><OTA_CancelRQ xmlns="http://www.opentravel.org/OTA/2003/05" CancelType="Cancel" EchoToken="37f1188c-dd53-4761-9936-a4e2efec964e" PrimaryLangID="en_US" Target="Test" TimeStamp="2018-07-26T06:03:45.002Z" TransactionIdentifier="C64BF6944C7D43758734FEAD345ED593" Version="5.000"><UniqueID ID="BW" Instance="CHN" Type="10"/><UniqueID ID="HTL01031" Instance="CNF" Type="14"/><UniqueID ID="CHN01031" Instance="PNR" Type="14"/></OTA_CancelRQ></SOAP-ENV:Body></SOAP-ENV:Envelope>']