project/tmp/20180608/report_bw-exp_16/cache/2.900000.txt

['<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><OTA_CancelRQ xmlns="http://www.opentravel.org/OTA/2003/05" CancelType="Cancel" EchoToken="01daf2de-33f9-4a6f-a860-6f364342bddb" PrimaryLangID="en_US" Target="Test" TimeStamp="2018-06-08T06:06:30.003Z" TransactionIdentifier="2825045543F7471A84A53E3F62C8C672" Version="5.000"><UniqueID ID="BW" Instance="CHN" Type="10"/><UniqueID ID="HTL01031" Instance="CNF" Type="14"/><UniqueID ID="CHN01031" Instance="PNR" Type="14"/></OTA_CancelRQ></SOAP-ENV:Body></SOAP-ENV:Envelope>']