project/tmp/20180726/report_bw-exp_25/cache/3.090000.txt

['<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><OTA_CancelRQ xmlns="http://www.opentravel.org/OTA/2003/05" CancelType="Cancel" EchoToken="0c269e5f-a767-4009-b3e6-2972b0d7fcdb" PrimaryLangID="en_US" Target="Test" TimeStamp="2018-07-26T05:57:35.002Z" TransactionIdentifier="114BCF8F67A04D118D4A8737D1C991B2" Version="5.000"><UniqueID ID="BW" Instance="CHN" Type="10"/><UniqueID ID="HTL01031" Instance="CNF" Type="14"/><UniqueID ID="CHN01031" Instance="PNR" Type="14"/></OTA_CancelRQ></SOAP-ENV:Body></SOAP-ENV:Envelope>']