src/Assets/MahanRequestTemplates/PriceQuote.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.isaaviation.com/thinair/webservices/OTA/Extensions/2003/05">
  <soap:Header>
    <wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>{{Username}}</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{Password}}</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soap:Header>
  <soap:Body xmlns:ns2="http://www.opentravel.org/OTA/2003/05">
    <!-- You can use EchoToken="?" as a message fetched from server -->
    <!-- TransactionIdentifier must be prvided -->
    <ns2:OTA_AirPriceRQ TransactionIdentifier="{{TransactionID}}">
      <ns2:POS>
        <ns2:Source TerminalID="{{TerminalID}}">
          <ns2:RequestorID ID="{{Username}}" Type="{{UniqueIDType}}" />
          <ns2:BookingChannel Type="{{BookingChannelType}}" />
        </ns2:Source>
      </ns2:POS>
      <ns2:AirItinerary DirectionInd="{{DirectionInd}}">
        <ns2:OriginDestinationOptions>
          {{OriginDestinationOption}}
        </ns2:OriginDestinationOptions>
      </ns2:AirItinerary>
      <ns2:TravelerInfoSummary>
        <ns2:AirTravelerAvail>
          {{Passengers}}
        </ns2:AirTravelerAvail>
      </ns2:TravelerInfoSummary>
    </ns2:OTA_AirPriceRQ>
  </soap:Body>
</soap:Envelope>