src/Assets/MahanRequestTemplates/BookingFlightRQ.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Header>
    <wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken wsu:Id="UsernameToken-17855236" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <wsse:Username>WSROMAPARVAZ</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">mahan1234</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soap:Header>
  <soap:Body xmlns:ns1="http://www.isaaviation.com/thinair/webservices/OTA/Extensions/2003/05" xmlns:ns2="http://www.opentravel.org/OTA/2003/05">
    <ns2:OTA_AirBookRQ EchoToken="11868765275150-1300257933" PrimaryLangID="en-us" SequenceNmbr="1" TimeStamp="2008-08-25T16:15:59" TransactionIdentifier="TID$127106978850125-1713595275" Version="20061.00">
      <ns2:POS>
        <ns2:Source TerminalID="THR572">
          <ns2:RequestorID ID="WSROMAPARVAZ" Type="4" />
          <ns2:BookingChannel Type="12" />
        </ns2:Source>
      </ns2:POS>
      <ns2:AirItinerary>
        <ns2:OriginDestinationOptions>
          <ns2:OriginDestinationOption>
            <FlightSegment ArrivalDateTime="{{arrivalDate}}T00:01:00" 
                DepartureDateTime="{{departDate}}T00:01:00" FlightNumber="{{flightNumber}}" RPH="{{rph}}">
              <DepartureAirport LocationCode="{{origin}}" Terminal="TerminalX" />
              <ArrivalAirport LocationCode="{{destination}}" Terminal="TerminalX" />
            </FlightSegment>
          </ns2:OriginDestinationOption>
        </ns2:OriginDestinationOptions>
      </ns2:AirItinerary>
       <ns2:TravelerInfo>
        <ns2:AirTraveler BirthDate="1976-08-12T00:00:00" PassengerTypeCode="ADT">
          <ns2:PersonName>
            <ns2:GivenName>adult given name</ns2:GivenName>
            <ns2:Surname>adult surname</ns2:Surname>
            <ns2:NameTitle>MR</ns2:NameTitle>
          </ns2:PersonName>
          <ns2:Telephone AreaCityCode="6" CountryAccessCode="971" PhoneNumber="5088952" />
          <ns2:Address>
            <ns2:CountryName Code="AU" />
          </ns2:Address>
          <ns2:Document DocHolderNationality="AE" />
          <ns2:TravelerRefNumber RPH="A1" />
        </ns2:AirTraveler> 
         <ns2:AirTraveler BirthDate="2005-08-12T00:00:00" PassengerTypeCode="CHD">
          <ns2:PersonName>
            <ns2:GivenName>child given name</ns2:GivenName>
            <ns2:Surname>child surname</ns2:Surname>
            <ns2:NameTitle>MR</ns2:NameTitle>
          </ns2:PersonName>
          <ns2:Telephone AreaCityCode="6" CountryAccessCode="971" PhoneNumber="5088952" />
          <ns2:Address>
            <ns2:CountryName Code="AU" />
          </ns2:Address>
          <ns2:TravelerRefNumber RPH="C2" />
        </ns2:AirTraveler> 
         <ns2:AirTraveler PassengerTypeCode="INF">
          <ns2:PersonName>
            <ns2:GivenName>infant</ns2:GivenName>
            <ns2:Surname>infant surname</ns2:Surname>
            <ns2:NameTitle>MR</ns2:NameTitle>
          </ns2:PersonName>
          <ns2:TravelerRefNumber RPH="I3/A1" />
        </ns2:AirTraveler> 
      </ns2:TravelerInfo> 
       <ns2:Fulfillment>
        <ns2:PaymentDetails>
          <ns2:PaymentDetail>
            <ns2:DirectBill>
              <ns2:CompanyName Code="SHJ444" />
            </ns2:DirectBill>
            <ns2:PaymentAmount Amount="2022.00" CurrencyCode="AED" DecimalPlaces="2" />
          </ns2:PaymentDetail>
        </ns2:PaymentDetails>
      </ns2:Fulfillment> 
    </ns2:OTA_AirBookRQ>
     <ns1:AAAirBookRQExt>
      <ns1:ContactInfo>
        <ns1:PersonName>
          <ns1:Title>MR</ns1:Title>
          <ns1:FirstName>Malaka</ns1:FirstName>
          <ns1:LastName>Ekanayake</ns1:LastName>
        </ns1:PersonName>
        <ns1:Telephone>
          <ns1:PhoneNumber>5088952</ns1:PhoneNumber>
          <ns1:CountryCode>212</ns1:CountryCode>
          <ns1:AreaCode>88</ns1:AreaCode>
        </ns1:Telephone>
        <ns1:Email>mekanayake@isaaviation.ae</ns1:Email>
        <ns1:Address>
          <ns1:CountryName>
            <ns1:CountryName>Morocco</ns1:CountryName>
            <ns1:CountryCode>MA</ns1:CountryCode>
          </ns1:CountryName>
          <ns1:CityName>city</ns1:CityName>
        </ns1:Address>
      </ns1:ContactInfo>
    </ns1:AAAirBookRQExt> 
  </soap:Body>
</soap:Envelope>